In [1]:
import pandas as pd
import boto3

In [7]:
bucket = 'ds23-churn-dataset'

In [8]:
s3 = boto3.client('s3')
obj = s3.get_object(Bucket = bucket, Key = 'Churn_Modelling.csv')
df = pd.read_csv(obj['Body'])
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [10]:
import sqlite3 as lite

con = lite.connect('population.db')

with con:
    cur = con.cursor()
    cur.execute("CREATE TABLE Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

In [20]:
conn = lite.connect('population.db')
query = "SELECT country FROM Population WHERE population > 50000000;"

df = pd.read_sql_query(query, conn)

for country in df['country']:
    print(country)

Germany
France
Italy

In [26]:
# Select countries from population table whose name starts with "s"

conn = lite.connect('population.db')
query = "SELECT country FROM Population WHERE country LIKE 'S%'"

df = pd.read_sql_query(query, conn)

for country in df['country']:
    print(country)

Spain
Spain

In [27]:
from pymongo import MongoClient
from datetime import datetime

client = MongoClient()

db = client['tutorial']
coll = db['articles']

doc = {
    'title': 'An article about MongoDB and Python',
    'author': 'Marco',
    'publication_date': datetime.utcnow(),
}

doc_id = coll.insert_one(doc).inserted_id

In [31]:
df = pd.read_csv('../multiTimeline.csv')
df.head()

                                           Category: All categories
Month   diet: (Worldwide) gym: (Worldwide)     finance: (Worldwide)
2004-01 100               31                                     48
2004-02 75                26                                     49
2004-03 67                24                                     47
2004-04 70                22                                     48